; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v6 ?v10)
             (pred_8 ?v13 ?v2)
             (pred_5 ?v6 ?v2)
             (pred_6 ?v8 ?v6 )
	     (pred_7 ?v6)
             (pred_9 ?v7)
             (pred_11 ?v13)
             (pred_2 ?v2)
             (pred_1 ?v6)
             (pred_12 ?v13)
             (pred_4 ?v6)
             (pred_10 ))



(:action op_4
:parameters (?v1 ?v3 ?v12 ?v5)
:precondition (and (pred_9 ?v1) (pred_9 ?v3) (pred_11 ?v12) (pred_2 ?v5)
          (pred_3 ?v1 ?v3) (pred_8 ?v12 ?v5)
                   (pred_5 ?v3 ?v5) (pred_7 ?v1) 
                   (pred_1 ?v3) (pred_12 ?v12))
:effect (and  (pred_4 ?v3) (not (pred_1 ?v3))))


(:action op_3
:parameters (?v1 ?v11)
:precondition (and (pred_9 ?v1) (pred_9 ?v11)
               (pred_7 ?v1) (pred_3 ?v1 ?v11) (pred_4 ?v11))
:effect (and (pred_7 ?v11) (not (pred_7 ?v1))))

(:action op_5
:parameters (?v1 ?v12)
:precondition (and (pred_9 ?v1) (pred_11 ?v12) 
                  (pred_7 ?v1) (pred_6 ?v12 ?v1) (pred_10 ))
:effect (and (pred_12 ?v12)
   (not (pred_6 ?v12 ?v1)) (not (pred_10 ))))


(:action op_1
:parameters (?v1 ?v9 ?v4)
:precondition (and (pred_9 ?v1) (pred_11 ?v9) (pred_11 ?v4)
                  (pred_7 ?v1) (pred_12 ?v4) (pred_6 ?v9 ?v1))
:effect (and (pred_12 ?v9) (pred_6 ?v4 ?v1)
        (not (pred_12 ?v4)) (not (pred_6 ?v9 ?v1))))

(:action op_2
:parameters (?v1 ?v12)
:precondition (and (pred_9 ?v1) (pred_11 ?v12) 
                  (pred_7 ?v1) (pred_12 ?v12))
:effect (and (pred_10 ) (pred_6 ?v12 ?v1) (not (pred_12 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_10 obj_05 obj_01 obj_16 obj_02 obj_04 obj_03 obj_17 obj_09 obj_07 obj_08 obj_12 obj_15 obj_14 obj_19
    obj_13 obj_20
    obj_18 obj_11
    )

    (:init
       (pred_10)

       (pred_9 obj_06)
       (pred_9 obj_10)
       (pred_9 obj_05)
       (pred_9 obj_01)
       (pred_9 obj_16)
       (pred_9 obj_02)
       (pred_9 obj_04)
       (pred_9 obj_03)
       (pred_9 obj_17)
       (pred_9 obj_09)
       (pred_9 obj_07)
       (pred_9 obj_08)
       (pred_9 obj_12)
       (pred_9 obj_15)
       (pred_9 obj_14)
       (pred_9 obj_19)
       (pred_2 obj_13)
       (pred_2 obj_20)
       (pred_11 obj_18)
       (pred_11 obj_11)

       (pred_3 obj_06 obj_16)
       (pred_3 obj_06 obj_10)
       (pred_3 obj_10 obj_02)
       (pred_3 obj_10 obj_05)
       (pred_3 obj_10 obj_06)
       (pred_3 obj_05 obj_04)
       (pred_3 obj_05 obj_01)
       (pred_3 obj_05 obj_10)
       (pred_3 obj_01 obj_03)
       (pred_3 obj_01 obj_05)
       (pred_3 obj_16 obj_17)
       (pred_3 obj_16 obj_02)
       (pred_3 obj_16 obj_06)
       (pred_3 obj_02 obj_09)
       (pred_3 obj_02 obj_04)
       (pred_3 obj_02 obj_10)
       (pred_3 obj_02 obj_16)
       (pred_3 obj_04 obj_07)
       (pred_3 obj_04 obj_03)
       (pred_3 obj_04 obj_05)
       (pred_3 obj_04 obj_02)
       (pred_3 obj_03 obj_08)
       (pred_3 obj_03 obj_01)
       (pred_3 obj_03 obj_04)
       (pred_3 obj_17 obj_12)
       (pred_3 obj_17 obj_09)
       (pred_3 obj_17 obj_16)
       (pred_3 obj_09 obj_15)
       (pred_3 obj_09 obj_07)
       (pred_3 obj_09 obj_02)
       (pred_3 obj_09 obj_17)
       (pred_3 obj_07 obj_14)
       (pred_3 obj_07 obj_08)
       (pred_3 obj_07 obj_04)
       (pred_3 obj_07 obj_09)
       (pred_3 obj_08 obj_19)
       (pred_3 obj_08 obj_03)
       (pred_3 obj_08 obj_07)
       (pred_3 obj_12 obj_15)
       (pred_3 obj_12 obj_17)
       (pred_3 obj_15 obj_14)
       (pred_3 obj_15 obj_09)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_14 obj_19)
       (pred_3 obj_14 obj_07)
       (pred_3 obj_14 obj_15)
       (pred_3 obj_19 obj_08)
       (pred_3 obj_19 obj_14)
       (pred_1 obj_19)
       (pred_1 obj_03)
       (pred_5  obj_19 obj_13)
       (pred_5  obj_03 obj_20)
       (pred_4 obj_06)
       (pred_4 obj_10)
       (pred_4 obj_05)
       (pred_4 obj_01)
       (pred_4 obj_16)
       (pred_4 obj_02)
       (pred_4 obj_04)
       (pred_4 obj_17)
       (pred_4 obj_09)
       (pred_4 obj_07)
       (pred_4 obj_08)
       (pred_4 obj_12)
       (pred_4 obj_15)
       (pred_4 obj_14)

       (pred_8  obj_18 obj_13)
       (pred_8  obj_11 obj_20)
       (pred_6 obj_18 obj_08)
       (pred_6 obj_11 obj_04)
       (pred_7 obj_16)
    )

    (:goal (and
       (pred_6 obj_11 obj_08)
    ))
(:constraints
  (always (not (pred_7 obj_02)))
)
)

; plan
1. (op_3 obj_16 obj_06)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_06)
   goals met: 0 of 1
2. (op_3 obj_06 obj_10)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_10)
   goals met: 0 of 1
3. (op_3 obj_10 obj_05)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_05)
   goals met: 0 of 1
4. (op_3 obj_05 obj_04)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_04)
   goals met: 0 of 1
5. (op_5 obj_04 obj_11)
   deleted: (pred_6 obj_11 obj_04) (pred_10)
   added: (pred_12 obj_11)
   goals met: 0 of 1
6. (op_3 obj_04 obj_07)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_07)
   goals met: 0 of 1
7. (op_3 obj_07 obj_08)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_08)
   goals met: 0 of 1
8. (op_1 obj_08 obj_18 obj_11)
   deleted: (pred_12 obj_11) (pred_6 obj_18 obj_08)
   added: (pred_12 obj_18) (pred_6 obj_11 obj_08)
   goals met: 1 of 1
